#+title: Dev Docs
* Endpoints needed
- "/skills" -> gets all the skills in the db
- "/diary_entries/{date}/skills" -> gets all diary entry skills for a particular date
- "/diary_entries/{date}" -> get the diary entry and all associated skills with that diary entry (will need another schema, migration, )
* Creating the necessary files
- there are 2 tables that we need:
   - diary_entries (contains the entry date, user id, and all the ratings)
   - skills (all the skills, their category and description)
* [[https://hexdocs.pm/phoenix/Mix.Tasks.Phx.Gen.html#module-crud-related-generators][CRUD related generators]]



#+begin_src elixir
# defmodule Woo do
#   defstruct "1": "baz", "2": "buzz"
# end

# defmodule Roo do
#   def transform(value) do
#     vals = %Woo{}
#     Map.get(vals, Integer.to_string(value), "default_value")
#   end
# end

Roo.transform(2)
#+end_src

* Starting up the server
#+begin_src eshell
mix phx.server
#+end_src

* Endpoint Testing
- to see all the available routes:
#+begin_src eshell
mix phx.routes
#+end_src

#+RESULTS:
#+begin_example
  GET     /api/skills                   MeteorWeb.SkillController :index
  GET     /api/skills/:id               MeteorWeb.SkillController :show
  POST    /api/skills                   MeteorWeb.SkillController :create
  PATCH   /api/skills/:id               MeteorWeb.SkillController :update
  PUT     /api/skills/:id               MeteorWeb.SkillController :update
  DELETE  /api/skills/:id               MeteorWeb.SkillController :delete
  GET     /api/diary_entries            MeteorWeb.DiaryEntryController :index
  GET     /api/diary_entries/:id        MeteorWeb.DiaryEntryController :show
  POST    /api/diary_entries            MeteorWeb.DiaryEntryController :create
  PATCH   /api/diary_entries/:id        MeteorWeb.DiaryEntryController :update
  PUT     /api/diary_entries/:id        MeteorWeb.DiaryEntryController :update
  DELETE  /api/diary_entries/:id        MeteorWeb.DiaryEntryController :delete
  GET     /api/diary_entry/:entry_date  MeteorWeb.DiaryEntryController :show_by_entry_date
  GET     /dev/dashboard/css-:md5       Phoenix.LiveDashboard.Assets :css
  GET     /dev/dashboard/js-:md5        Phoenix.LiveDashboard.Assets :js
  GET     /dev/dashboard                Phoenix.LiveDashboard.PageLive :home
  GET     /dev/dashboard/:page          Phoenix.LiveDashboard.PageLive :page
  GET     /dev/dashboard/:node/:page    Phoenix.LiveDashboard.PageLive :page
  ,*       /dev/mailbox                  Plug.Swoosh.MailboxPreview []
  WS      /live/websocket               Phoenix.LiveView.Socket
  GET     /live/longpoll                Phoenix.LiveView.Socket
  POST    /live/longpoll                Phoenix.LiveView.Socket

#+end_example

#+begin_src restclient
GET http://localhost:4000/api/diary_entries
#+end_src

#+RESULTS:
#+BEGIN_SRC js
{
  "data": [
    {
      "anger": 1,
      "drug_use": 2,
      "entry_date": "2023-02-12",
      "fear": 2,
      "id": 1,
      "joy": 2,
      "notes": null,
      "pain": 4,
      "sadness": 3,
      "self_harm": 0,
      "shame": 2,
      "skills": [
        {
          "id": 2,
          "category": "distress_tolerance",
          "description": "Ctop, take a step back, observe, proceed mindfully",
          "name": "STOP"
        },
        {
          "id": 3,
          "category": "distress_tolerance",
          "description": "Change your body chemistry",
          "name": "TIPP"
        }
      ],
      "suicide": 2,
      "user_id": 1
    }
  ]
}
// GET http://localhost:4000/api/diary_entries
// HTTP/1.1 200 OK
// cache-control: max-age=0, private, must-revalidate
// content-length: 398
// content-type: application/json; charset=utf-8
// date: Fri, 02 Feb 2024 22:21:58 GMT
// server: Cowboy
// x-request-id: F7Ar5HXX_asQ8m8AAAMD
// Request duration: 0.146277s
#+END_SRC

#+begin_src restclient
GET http://localhost:4000/api/skills
#+end_src

#+RESULTS:
#+BEGIN_SRC js
{
  "data": [
    {
      "category": "distress_tolerance",
      "description": "Ctop, take a step back, observe, proceed mindfully",
      "id": 2,
      "name": "STOP"
    },
    {
      "category": "distress_tolerance",
      "description": "Change your body chemistry",
      "id": 3,
      "name": "TIPP"
    },
    {
      "category": "mindfulness",
      "description": "Balance Rational Mind and Emotional Mind",
      "id": 4,
      "name": "Wise Mind"
    },
    {
      "category": "emotion_regulation",
      "description": "Do the opposite of what your emotions tell you to do",
      "id": 5,
      "name": "Opposite Action"
    }
  ]
}
// GET http://localhost:4000/api/skills
// HTTP/1.1 200 OK
// cache-control: max-age=0, private, must-revalidate
// content-length: 475
// content-type: application/json; charset=utf-8
// date: Fri, 29 Dec 2023 21:48:20 GMT
// server: Cowboy
// x-request-id: F6Vrvsx9JQcQ8m8AAABE
// Request duration: 0.132209s
#+END_SRC

#+begin_src restclient
DELETE http://localhost:4000/api/skills/1
#+end_src

#+RESULTS:
#+BEGIN_SRC js
// DELETE http://localhost:4000/api/skills/1
// HTTP/1.1 204 No Content
// cache-control: max-age=0, private, must-revalidate
// date: Sun, 17 Sep 2023 19:14:37 GMT
// server: Cowboy
// x-request-id: F4PTNhlAfgFc7nYAAABm
// Request duration: 0.087408s
#+END_SRC
